note/2018/emacs-keymap-precedence/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-12 Sat 16:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Keymap Precedence</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Yuan Fu" />
<link rel="stylesheet" type="text/css" href="../../style.css"/>
<link rel="icon" type="image/png" href="../../../favicon.png">
</head>
<body>
<div id="org-div-home-and-up-index-page">
<div>
<a accesskey="h" href="../../index.html"> UP </a> |
<a accesskey="H" href="../../../index.html"> HOME </a>
</div>
<div>
<a href="../../rss.xml"> RSS </a> |
<a href="https://github.com/casouri/casouri.github.io"> Source </a> |
<a href="https://creativecommons.org/licenses/by-sa/4.0/"> License </a>
</div>
</div><div id="content">
<h1 class="title">Emacs Keymap Precedence</h1>
<p>
Discussion from <a href="https://emacs-china.org/t/topic/7587/6">a post in emacs-china</a>. Copied from <a href="https://xuchunyang.me">xuchunyang</a>.
</p>

<p>
As a quick note, Emacs keymaps take precedence as follows:
</p>

<ol class="org-ol">
<li>overriding-terminal-local-map</li>
<li>overriding-local-map</li>
<li>text property's 'keymap property</li>
<li>emulation-mode-map-alists</li>
<li>minor-mode-overriding-map-alist</li>
<li>minor-mode-map-alist (Minor Mode)</li>
<li>text property's 'local-map property</li>
<li>(current-local-map) (Major Mode)</li>
<li>(current-global-map) (Global Map)</li>
</ol>

<p>
Related <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Searching-Keymaps.html">Emacs Manual Node</a>.
</p>
</div>
<div id="postamble" class="status">
<p class="author">Written by Yuan Fu</p>
<p class="first-publish">First Published on 2018-11-15 Thu 00:00</p>
<p class-"last-modified">Last modified on 2020-09-12 Sat 16:10</p>
<p>Send your comment to 
<a href="mailto:archive.casouri.cat@gmail.com">
archive.casouri.cat@gmail.com</a></p>
</div>
</body>
</html>
